"use strict"

let final;
let typeArr = [0, 5000, 10000, 20000];
let designArr = [0, 10000, 5000, 15000];
let adaptArr = [0, 1000, 5000, 10000];

alert("Выберите тип сайта: 1=Сайт-взитка | 2=Интернет магазин | 3=Сайт для бизнеса"); 
let type = prompt("Тип сайта:");
alert("Выберите желаемый дизайн: 1=Уникальный дизайн | 2=Строгий дизайн | 3=Дизайн на заказ");
let design = prompt("Дизайн вашего будущего сайта:");
alert("Выберите для каких устройств вам нужен сайт: 1=Только для ПК | 2=Только для мобильных устройств | 3=Для ПК и мобильных устройств")
let adapt = prompt("Выберите необходимый уровень адаптивности:"); 

final = typeArr[type] + designArr[design] + adaptArr[adapt];
alert("Итоговая стоимость работ: " + final); 

